src/InformationRegisters/ФайлыНаРаспознавании/ФайлыНаРаспознавании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыНаРаспознавании</name>
  <resources>
    <name>ДатаПередачиНаРаспознавание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейПроверкиРезультата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>39</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ФайлыНаРаспознавании/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПредставлениеФайла();
	
	ЗаполнитьДатыДляОтображения();
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Запись.Файл);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставлениеФайла()
	
	СсылкаНаФайл1 = ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
		Запись.Файл, "Владелец");
	
	СсылкаНаФайл2 = Запись.Файл;
	
	ПредставлениеФайла = "";
	Если ЗначениеЗаполнено(СсылкаНаФайл1) Тогда
		ПредставлениеФайла = Строка(СсылкаНаФайл1) + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СсылкаНаФайл2) Тогда
		ПредставлениеФайла = ПредставлениеФайла + Строка(СсылкаНаФайл2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыДляОтображения()
	
	ДатаСеанса = ТекущаяДатаСеанса();
	ДатаСеансаУниверсальная = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса());
	ПоправкаКУниверсальномуВремени = ДатаСеансаУниверсальная - ДатаСеанса;
	
	ДатаПередачиНаРаспознавание = Запись.ДатаПередачиНаРаспознавание - ПоправкаКУниверсальномуВремени;
	ДатаПоследнейПроверкиРезультата = Запись.ДатаПоследнейПроверкиРезультата - ПоправкаКУниверсальномуВремени;
	
КонецПроцедуры

#КонецОбласти
